[
 {
  "date": "2023-03-03T11:30:00",
  "duration": 2,
  "arguments": [
   {
    "en": "Course presentation",
    "it": "Presentazione del corso"
   },
   {
    "en": "Course topics: RESTful web services",
    "it": "Presentazione degli argomenti: RESTful web services"
   },
   {
    "en": "RESTful services as an extension to standard web applications",
    "it": "I servizi RESTful come estensione delle applicazioni web standard",
    "type": "esempio"
   },
   {
    "en": "RESTful services as a base for client-side applications like SPA (Angular, etc.)",
    "it": "I servizi RESTful come elemento base delle applicazioni fortemente client side come le SPA (Angular, ecc.)",
    "type": "esempio"
   },
   {
    "en": "RESTful services as a base for hybrid modile apps (Cordova, etc.)",
    "it": "I servizi RESTful come elemento base delle applicazioni mobili ibride (Cordova, ecc.)",
    "type": "esempio"
   },
   {
    "en": "Course topics: JQuery",
    "it": "Presentazione degli argomenti: JQuery"
   },
   {
    "en": "JQuery as a fundamental element for Javascript crossbrowser programming",
    "it": "JQuery come elemento essenziale per la programmazione crossbrowser in Javascript",
    "type": "esempio"
   },
   {
    "en": "JQuery as an helper in writing rich client-side interfaces",
    "it": "JQuery come elemento di aiuto nella realizzazione di interfacce ricche lato client",
    "type": "esempio"
   },
   {
    "en": "JQuery is a low-level library! Isn't it better to employ, e.g., Angular to build a RIA?",
    "it": "JQuery è comunque una libreria di basso livello! Non è meglio, ad esempio, usare Angular per realizzare una RIA?",
    "type": "esempio"
   },
   {
    "ref": "Slides WS-Rest",
	"link": "https://github.com/SviluppoWebAvanzato-Univaq/SWA_Lecture_Slides",
    "en": "Web services and Web 2.0",
    "it": "I Web services nel Web 2.0"
   },
   {
    "en": "What web services really are?",
    "it": "Cosa sono i web services veramente?"
   },
   {
    "en": "What is the role of web services in web 2.0?",
    "it": "Che ruolo giocano i web services nel web 2.0?"
   },
   {
    "en": "Analysis of some services published by the Public Administration on the web",
    "it": "Analisi di servizi pubblicati su web dalla PA",
    "type": "esempio"
   },
   {
    "en": "An example of real web services: Amazon",
    "it": "Un esempio di veri web services: Amazon",
    "type": "esempio"
   },
   {
    "en": "Making the Public Administration services real web services",
    "it": "Realizzare i servizi della PA come veri web services",
    "type": "esempio"
   },
   {
    "en": "RESTful web services: when to use them, and what alternatives exist",
    "it": "I servizi web RESTful: quando usarli, e quali alternative esistono"  
   }
  ],
  "title": {
   "en": "Introduction to (RESTful) web services",
   "it": "Introduzione ai (RESTful) web services"
  }
 },
 {
  "date": "2023-03-10T11:30:00",
  "duration": 2,
  "arguments": [
   {
    "en": "The REST paradigm",
    "it": "Il paradigma REST"
   },
   {
    "ref": "Slides Restful",
	"link": "https://github.com/SviluppoWebAvanzato-Univaq/SWA_Lecture_Slides",
    "en": "Web services with REST paradigm: RESTful web services",
    "it": "I servizi web con paradigma REST: RESTful web services"
   },
   {
    "en": "Basic features of a RESTful service: protocols, formats, methods",
    "it": "Caratteristiche di base di un servizio RESTful: protocolli, formati, metodi invocabili"
   },
   {
    "en": "Semantics of a RESTful web service: what kind of application it is best suited for?",
    "it": "Semantica di un servizio web RESTful: a quali tipi di applicazione si adatta meglio?"
   },
   {
    "en": "RESTful services URL structure",
    "it": "Struttura delle URL in un servizio RESTful"
   },
   {
    "en": "Mapping resources to URLs: the basic collection-item structure",
    "it": "Mappare le risorse sulle URL: la struttura di base collection-item"
   },
   {
    "en": "Mapping relational structures to RESTful URLs",
    "it": "Mappare strutture relazionali su URL RESTful",
    "type": "esempio"
   },
   {
    "en": "CRUD RESTful operations: the GET mathod",
    "it": "Operazioni CRUD via RESTful: il metodo GET"
   },
   {
    "en": "GET on collections: SELECT",
    "it": "GET su collezioni: SELECT",
    "type": "esempio"
   },
   {
    "en": "GET on collections with a query string: SELECT * WHERE",
    "it": "GET su collezioni con query string: SELECT * WHERE",
    "type": "esempio"
   },
   {
    "en": "Encoding of  data returned by a GET and the Accept/Content-Type headers",
    "it": "La codifica dei dati restituiti da una GET e gli header Accept/Content-Type"
   },
   {
    "en": "The return value of GET on collections: records or keys  list?",
    "it": "Il valore di ritorno delle GET su collezioni: lista di record o di sole chiavi?"
   },
   {
    "en": "GET on collections: use of the query string to create a LIMIT clause",
    "it": "GET su collezioni: usare la query string per simulare la clausola LIMIT",
    "type": "esempio"
   },
   {
    "en": "GET on item: SELECT * WHERE id = ...",
    "it": "GET su item: SELECT * WHERE id=...",
    "type": "esempio"
   },
   {
    "en": "GET on attributes: SELECT a WHERE id = ...",
    "it": "GET su attributi: SELECT a WHERE id=...",
    "type": "esempio"
   },
   {
    "en": "GET: HTTP return status",
    "it": "GET: stati HTTP di ritorno"
   },
   {
    "en": "CRUD RESTful operations: the PUT method",
    "it": "Operazioni CRUD via RESTful: il metodo PUT"
   },
   {
    "en": "PUT on item: global UPDATE of a specific record",
    "it": "PUT su item: UPDATE globale su uno specifico record",
    "type": "esempio"
   },
   {
    "en": "The payload of the PUT method and the Content-Type header",
    "it": "Il payload del metodo PUT e l'header Content-Type"
   },
   {
    "en": "PUT on attributes: UPDATE pf individual attributes of a specific record",
    "it": "PUT su attributi: UPDATE di singoli attributi di uno specifico record",
    "type": "esempio"
   },
   {
    "en": "PUT on collections: replacement of an entire collection",
    "it": "PUT su collezioni: sostituzione di un'intera collezione",
    "type": "esempio"
   },
   {
    "en": "PUT: HTTP return status",
    "it": "PUT: stati HTTP di ritorno"
   },
   {
    "en": "CRUD RESTful operations: the PATCH method",
    "it": "Operazioni CRUD via RESTful: il metodo PATCH"
   },
   {
    "en": "PATCH on item: partial UPDATE of a specific record",
    "it": "PATCH su item: UPDATE parziale su uno specifico record",
    "type": "esempio"
   },
   {
    "en": "Extension of PUT semantics in environments not supporting the PATCH",
    "it": "Estensione della semantica PUT in ambienti che non supportano la PATCH"
   }
  ],
  "title": {
   "en": "RESTful services semantics",
   "it": "La semantica dei servizi RESTful"
  }
 }
]